// TODO: Grunt-Minify
// TODO: keen($('a'))

(function($){

	var regions = [
		{
			region: { x: 1159, y: 479 },
			irgun: false,
			color: 'orange',

			name: 'חדר מצב',
			desc: ['ערוץ תקשורת אלטרנטיבי של המאבק החברתי.','הצטרפו לחדר המצב כדי לפקוח את העיניים ולראות את המציאות סביבכם מזווית שטרם הכרתם.','אנו מפעילים מרכז מידע והנעה לפעולה בזמן אמת. תוכלו למצוא בו חדשות ועדכונים חמים מרתקים מהשטח ובלי צנזורה!','חדר המצב מאויש על ידי קבוצת פעילים, כולם בהתנדבות מלאה, המהווים יחד צוות של חדשות המחאה - מקדמים ומפיצים את המתרחש ברשת.'],
			link: '/groups/54825bd1abb7e0355f8ab87d'
		},{
			region: { x: 760, y: 344 },
			irgun: false,
			color: 'orange',

			name: 'מגפון',
			desc: ['עיתון העיתונאים. מיזם תוכן עיתונאי אינטרנטי. הוקם ומנוהל במתכונת של קואופרטיב - בבעלות משותפת של העובדים בו כתבים, כותבים ועורכים, צלמים ומעצבים, בעלי טורים, אנשי שטח ומשרד, אנשי מסחר ומודעות ועוד.'],
			link: '/groups/54825bd3abb7e0355f8ab87e'
		},{
			region: { x: 937, y: 142 },
			irgun: false,
			color: 'orange',

			name: 'רשת שידורים חיים מהשטח',
			desc: ['עיתונות אזרחית. ערוצי שידור ustream מרחבי הארץ.'],
			link: '/groups/54825bd4abb7e0355f8ab87f'
		},{
			region: { x: 877, y: 71 },
			irgun: true,
			color: 'orange',

			name: 'הטלויזיה החברתית',
			desc: ['ארגון לשינוי חברתי הפועל כגוף תקשורת אזרחי - עצמאי לקידום סדר יום חברתי בישראל.'],
			link: '/groups/54825bd5abb7e0355f8ab880'
		},{
			region: { x: 1021, y: 177 },
			irgun: false,
			color: 'orange',

			name: 'כנסת פתוחה',
			desc: ['אתר שנועד להעצים את האזרחים בישראל ולאפשר לכל אזרח להשתתף באורח פעיל יותר בפעילות הכנסת.','האתר מציג את המידע על מה שקורה בכנסת בצורה נוחה וברורה למשתמש ומאפשר דיון של גורמים מקצועיים ואזרחים מן השורה בנושאים של שולחן המחוקקים.','האתר מנגיש את המידע בכדי שכל אזרח ואזרחית יידעו על מה הם רוצים להשפיע ועוזר לאזרחים להשפיע על-ידי יצירת פלטפורמה לדיאלוג בין הציבור לנציגיו בכנסת.'],
			link: '/groups/54825bd6abb7e0355f8ab881'
		},{
			region: { x: 735, y: 268 },
			irgun: false,
			color: 'orange',

			name: 'PolitiWatch',
			desc: ['פלטפורמה אינטרנטית העוקבת אחר הפעילות הפוליטית ומנגישה את המידע באופן ברור, אמין וחסר פניות לציבור.'],
			link: '/groups/54825bd7abb7e0355f8ab882'
		},{
			region: { x: 788, y: 93 },
			irgun: false,
			color: 'orange',

			name: 'העוקץ',
			desc: ['במה עצמאית לדיון ביקורתי בחברה בישראל, בה מאות כותבות וכותבים מפרסמים בו מאמרים מקצועיים ומקוריים בנושאי כלכלה, פוליטיקה, פילוסופיה, אמנות, מוזיקה, קולנוע, פמיניזם, אקטיביזם, זכויות אדם ועוד. ניסיון להוות אלטרנטיבה לתקשורת הממוסדת.'],
			link: '/groups/54825bd8abb7e0355f8ab883'
		},{
			region: { x: 1183, y: 296 },
			irgun: false,
			color: 'orange',

			name: 'עבודה שחורה',
			desc: ['אתר אינטרנט הפועל למען שמירת אופיה של מדינת ישראל כמדינת רווחה סוציאל-דמוקרטית.'],
			link: '/groups/54825bd9abb7e0355f8ab884'
		},{
			region: { x: 1112, y: 146 },
			irgun: true,
			color: 'orange',
			name: 'התנועה לחופש המידע',
			desc: ['תנועה הפועלת לקידום שקיפות במוסדות ציבוריים, להגברת הפיקוח על פעילותן של רשויות ציבוריות, ולעידוד הציבור לעשות שימוש בזכותו למידע.','אנו מאמינים כי קידומן של מטרות אלה יוביל ליצירתה של חברה פתוחה, דמוקרטית וצודקת יותר בישראל.'],
			link: '/groups/54825bdaabb7e0355f8ab885'
		},{
			region: { x: 1103, y: 334 },
			irgun: false,
			color: 'orange',

			name: 'הכלכלה האמיתית',
			desc: ['אתר א-פוליטי ועצמאי אשר שם לעצמו למטרה להעביר בצורה אוביקטיבית ככל האפשר את המתרחש בעולם הכלכלי בו אנו נמצאים.','המאמרים והעובדות שמוצגים באתר מובאים ללא פילטרים, הגבלות או הוראות מלמעלה תוך התמקדות בנושאים שהמדיה המרכזית נמנעת מלגעת בהם מסיבות השמורות עימה. כל המקורות שלנו חשופים ושקופים ככל הניתן ,תחת התנית אישור המקור.','פעילות האתר נעשית על בסיס התנדבותי בלבד ואינה קשורה או ממומנת על ידי אף מפלגה או ארגון.'],
			link: '/groups/54825bdbabb7e0355f8ab886'
		},{
			region: { x: 759, y: 182 },
			irgun: false,
			color: 'orange',

			name: 'המקום הכי חם בגיהנום',
			desc: ['מגזין עיתונות הדבק בעקרונות של דמוקרטיה, שיוויון וצדק חברתי. עיתונות שלא מפחדת לקחת צד. ששומרת על פרופורציות, שאינה מתלהמת, שנצמדת לעובדות ולסטנדרטים מקצועיים, סקרנית וחוקרת, אבל אינה שקועה עד צוואר בביצת הנייטראליות הדביקה והמזויפת.','נביא כאן סיפורים שמוצנעים בתקשורת הממוסדת, או אינם מתפרסמים כלל, בגלל שאינם תואמים את האינטרס של המו"ל, או שאינם עונים על מדדי אטרקטיביות מלאכותיים שקבעו כלי תקשורת אחרים. נטפל בתופעות שקשורות ליחידים או לקבוצות, במאבקים ציבוריים, בסיפורים החברתיים, התרבותיים והפוליטיים. נפרסם פרופילים, ראיונות ודעות שונות ולא נפסיק לשאול שאלות על המקום שאנחנו חיים בו.','אולי קשה לשנות את העולם, אבל בעזרת הסיפור העיתונאי אפשר לעשות שינוי. בשביל זה אנחנו כאן. באנו להפר את השקט.'],
			link: '/groups/54825bddabb7e0355f8ab887'
		},{
			region: { x: 1180, y: 387 },
			irgun: false,
			color: 'orange',

			name: 'מרפסת',
			desc: ['מגזין תל אביבי אלטרנטיבי בקצב יומיומי, בנושאי תרבות, מעורבות והתפר ביניהם.'],
			link: '/groups/54825bdeabb7e0355f8ab888'
		},{
			region: { x: 1087, y: 425 },
			irgun: false,
			color: 'orange',

			name: 'Mike & Natalie News',
			desc: ['מגזין חדשות חברתיות ביוטיוב.'],
			link: '/groups/54825bdfabb7e0355f8ab889'
		},{
			region: { x: 1071, y: 527 },
			irgun: false,
			color: 'orange',

			name: 'העולם אחרת',
			desc: ['מגזין חדשות הסוקר את המאבק החברתי העולמי עם ביקורת מזווית אחרת ופרשנות בועטת. הפגנות ענק, קריסת בנקים, חשיפת שחיתויות, שינויים חברתיים היסטוריים.'],
			link: 'groups/54825be0abb7e0355f8ab88a'
		},{
			region: { x: 996, y: 461 },
			irgun: false,
			color: 'orange',

			name: 'WeShare',
			desc: ['מגזין אלטרנטיבי על כלכלה שיתופית, פתרונות ירוקים חדשניים, צרכנות חברתית ועוד.','נוסד ב-2014 כמגזין של קהילת מטבע o-share.'],
			link: '/groups/54825be1abb7e0355f8ab88b'
		},{
			region: { x: 1012, y: 80 },
			irgun: true,
			color: 'orange',

			name: 'החדשות מהירקון שבעים',
			desc: ['מהדורת חדשות עצמאית, הפועלת לצמצום הפערים החברתיים, הכלכליים, הסביבתיים והלאומיים בישראל. מדי יום א\' בערב בסינמטק תל אביב ובאינטרנט.','החדשות מהירקון שבעים מופקות באופן עצמאי על ידי קבוצת אנשי תקשורת ותרבות, במטרה להשפיע על השיח בישראל ולחתור לחברה שוויונית וצודקת.'],
			link: '/groups/54825be2abb7e0355f8ab88c'
		},{
			region: { x: 852, y: 190 },
			irgun: true,
			color: 'orange',

			name: 'אוטופיה שלי- תקשורת ומידע',
			desc: ['ערוץ תקשורת ומדיה באינטרנט הנותן מענה לאירועי חברה, תרבות ופנאי של הקהילה האתיופית בדגש מתן במה לאמנים יוצרים להתבטא בכל תחומים וכך לעשות שינוי בקרב צעירי הקהילה.'],
			link: '/groups/54825be3abb7e0355f8ab88d'
		},{
			region: { x: 1269, y: 264 },
			irgun: false,
			color: 'orange',

			name: 'אנו',
			desc: ['מיזוג של שלושה ארגונים לשינוי חברתי - אג\'נדה השדרה ועורו.','אנו הוא ארגון לשינוי חברתי, הפועל לחיזוק הדמוקרטיה הישראלית, קידום סוגיות חברתיות וכלכליות והעשרת השיח הציבורי, באמצעות אקטיביזם תקשורתי ודיגיטלי.'],
			link: '/groups/54825be4abb7e0355f8ab88e'
		},{
			region: { x: 836, y: 285 },
			irgun: false,
			color: 'orange',

			name: 'השעה ה-25',
			desc: ['השעה ה-25 מביאים אליכם הרצאות במקומות בילוי, ערבי ג\'ם ויצירה אומנותית פתוחים לכל האוכלוסייה, מתוך אהבה, רצון להנעה וראייה קדימה.'],
			link: '/groups/54825be5abb7e0355f8ab88f'
		},{
			region: { x: 853, y: 375 },
			irgun: false,
			color: 'orange',

			name: 'עמק השווה',
			desc: ['סדרת מפגשי עיון ודיון של קהילת הצדק החברתי ברחובות'],
			link: '/groups/54825be7abb7e0355f8ab890'
		},{
			region: { x: 1022, y: 369 },
			irgun: false,
			color: 'orange',

			name: 'הסדנא לידע ציבורי',
			desc: ['עמותה פועלת להגברת השתתפות ציבורית בישראל, על ידי איסוף, פתיחה והנגשה של מידע שמצוי ברשותם של גופי ממשל ומגזר ציבורי.','באמצעות טכנולוגיות מתקדמות וקוד פתוח, מפתחת קהילת המתנדבים והפעילים שלנו מגוון כלים המאפשרים להפוך את המידע לידע ובכך להעצים את החברה האזרחית ואת נציגי הציבור.'],
			link: '/groups/54825be8abb7e0355f8ab891'
		},{
			region: { x: 1199, y: 202 },
			irgun: false,
			color: 'orange',

			name: 'קהילת יזמות חברתית',
			desc: ['קבוצה הפועלת במטרה לחבר בין יזמים חברתיים, מתנדבים, ומי שרוצה להיות כזה, וליצור מסגרת מעצימה ומחוללת השראה.','קהילת יזמות חברתית שמה לה למטרה לחבר בין יזמים חברתיים, מתנדבים, ומי שרוצה להיות כזה, וליצור מסגרת מעצימה ומחוללת השראה.'],
			link: '/groups/54825be9abb7e0355f8ab892'
		},{
			region: { x: 1110, y: 240 },
			irgun: false,
			color: 'orange',

			name: 'הכסא המתנדנד',
			desc: ['קבוצה ששמה לה למטרה להוסיף לאירועי מחאה פן יצירתי, הם לרב לא מארגנים אירועים משלהם אלא מגיעים לאירועים שארגנו אחרים מצוידים במסכות, שלטים שנונים, פסלים ועושים במקום מעין מיצג.'],
			link: '/groups/54825beaabb7e0355f8ab893'
		},{
			region: { x: 1270, y: 561 },
			irgun: false,
			color: 'purple',

			name: 'המשמר החברתי בכנסת',
			desc: ['עמותה הפועלת  לקיום נוכחות אזרחית רציפה בכנסת, ולדיווח שוטף וביקורתי על תהליכי החקיקה בנושאי כלכלה צודקת ושוויון אזרחי לדאוג לנוכחות אזרחית רציפה ועיקשת בכנסת, כדי להזכיר לח"כים שהציבור לא שכח את תביעתו לצדק חברתי, ולחזק את בית הנבחרים אל מול לחצי ההון.'],
			link: '/groups/54825bebabb7e0355f8ab894'
		},{
			region: { x: 1258, y: 780 },
			irgun: false,
			color: 'purple',

			name: 'מתפקדים',
			desc: ['קבוצה המעודדת התפקדות למפלגות השונות מתוך אמונה כי לשנות אפשר רק מבפנים.'],
			link: '/groups/54825becabb7e0355f8ab895'
		},{
			region: { x: 1177, y: 564 },
			irgun: false,
			color: 'purple',

			name: 'המשמר החברתי המקומי',
			desc: ['עמותה המאפשרת פלטפורמה לשיתוף האזרחים ולהעלאת מעורבותם והשפעתם.','היוזמה מקודמת על ידי פעילים חברתיים ברשת מוקדים ברחבי הארץ ומטרתה לייצר שקיפות ומנהל תקין בשלטון המקומי ולהפעיל לחץ רציף באמצעות פעילים ואזרחים מעורבים בדרישה למחויבות נבחרי הציבור לתושבים.'],
			link: '/groups/54825bedabb7e0355f8ab896'
		},{
			region: { x: 1330, y: 404 },
			irgun: false,
			color: 'purple',

			name: 'שינוי מוניטארי - מקדמים כלכלה מקיימת',
			desc: ['קבוצה הפועלת לצירת לחץ חברתי למען בנקאות הוגנת במחיר הוגן, לרבות: כנסים, הפגנות, פעילות הסברה בקרב הציבור ובקרב נבחרי ציבור למען חקיקה לשיפור מצב לקוחות הבנקים והקפדה על אכיפת החוק על הבנקים.'],
			link: '/groups/54825beeabb7e0355f8ab897'
		},{
			region: { x: 1093, y: 622 },
			irgun: false,
			color: 'purple',

			name: 'בנקים - לא מעל החוק',
			desc: ['ארגון חוץ פרלמנטרי שמטרתו להביא לשינוי השיטה המוניטרית בישראל ולהכנסת מטבעות משלימים לחיזוק קהילות.'],
			link: '/groups/54825bf0abb7e0355f8ab898'
		},{
			region: { x: 1255, y: 462 },
			irgun: true,
			color: 'purple',

			name: 'האגודה לזכויות האזרח',
			desc: ['אגודה הפועלת מאז הקמתה בשנת 1972 להגנה על זכויות האדם ולקידומן, בכל מקום שבו הפגיעה בזכויות נעשית על ידי רשויות ישראליות או מטעמן.','כיום אנו מוכּרים כארגון זכויות האדם הגדול, הוותיק והמוביל בישראל, ואנו גם הארגון היחיד העוסק בכל קשת זכויות האדם: משמירה על חופש הביטוי ועד מימוש הזכות לבריאות, מהגנה על זכויות האדם בשטחים הכבושים ועד לחופש הפולחן, ממאבק לשוויון אזרחי מלא ועד להגנה על הפרטיות שלנו באינטרנט.','כל זאת, על מנת לחולל את השינויים המערכתיים והחברתיים הנדרשים, וכדי שנוכל לדבר, לחשוב ולחיות במציאות שמכבדת זכויות אדם, ששומרת על הזכויות שלנו, שמגנה עלינו.'],
			link: '/groups/54825bf1abb7e0355f8ab899'
		},{
			region: { x: 1122, y: 761 },
			irgun: true,
			color: 'purple',
		
			name: 'העמותה לדמוקרטיה מתקדמת',
			desc: ['עמותה הנאבקת מאז 2007 להגשמת חזון ארוך טווח של יצירת פתרונות לתחלואי קשרי הון-שלטון-עיתונות בישראל.'],
			link: '/groups/54825bf2abb7e0355f8ab89a'
		},{
			region: { x: 1387, y: 679 },
			irgun: true,
			color: 'purple',

			name: 'התנועה לאיכות השלטון',
			desc: ['תנועה ששמה לה למטרה קידום ממשל איכותי יותר עבור אזרחי ישראל. התנועה רואה בדמוקרטיה אפקטיבית ומוגנת צורך חיוני, על אחת כמה וכמה במדינה צעירה כמדינת ישראל.','במשך השנים התנועה הציבה עצמה כ"כלב השמירה" על שלטון החוק, על טוהר המידות ועל טובת הציבור.'],
			link: '/groups/54825bf3abb7e0355f8ab89b'
		},{
			region: { x: 1343, y: 497 },
			irgun: false,
			color: 'purple',
		
			name: 'פורום החוסכים לפנסיה בישראל (פ\' זה פנסיה)',
			desc: ['עמותה שנועדה להגן על זכויות החוסכים לפנסיה צוברת (לא תקציבית) בישראל. להבטיח שהרגולטורים, סוכנויות וחברות הביטוח ובתי ההשקעות ידאגו לטובתנו, ושנוכל גם לנהל את הפנסיה בעצמנו.'],
			link: '/groups/54825bf4abb7e0355f8ab89c'
		},{
			region: { x: 1380, y: 326 },
			irgun: true,
			color: 'purple',

			name: 'מעש',
			desc: ['ארגון הפועל לחיזוק ולהתחדשות השירות הציבורי בישראל. הארגון פועל לקידום והכוונה של שינויי מדיניות בתחום ניהול ההון האנושי בשירות הציבורי ולבניית תשתית רחבה להשתלבותם של משרתי ציבור חדשים.','מעש מתמקדת בזיהוי וטיפול בחסמי כניסה למגזר הציבורי ובקידום תהליכי שינוי מול מקבלי החלטות. בנוסף, מפעיל הארגון את "המאתר" - מאגר מועמדים פתוח לציבור המאפשר לכל אזרח להציג מועמדותו לשירות הציבורי.'],
			link: '/groups/54825bf5abb7e0355f8ab89d'
		},{
			region: { x: 1351, y: 771 },
			irgun: false,
			color: 'purple',
		
			name: 'מכסחי הטייקונים',
			desc: ['קבוצה א-פוליטית שהוקמה במטרה לצאת מהמטריקס ו- "לייבש את הביצות" (תזרים המזומנים של הטייקונים)!! לקדם מותגים ומוצרים של יצרנים קטנים ואיכותיים, לסייע בייעוץ ופתרון בעיות צרכנות ככל שניתן.'],
			link: '/groups/54825bf6abb7e0355f8ab89e'
		},{
			region: { x: 1366, y: 590 },
			irgun: false,
			color: 'purple',

			name: 'היוזמה לפירוק הריכוזיות',
			desc: ['ארגון חברתי-כלכלי הפועל למען צמצום הריכוזיות במשק והורדת יוקר המחיה.','הארגון פועל מנקודת מוצא לפיה הריכוזיות, על כל צורותיה (טייקונים, קרטלים, מונופולים...) היא שורש החולי של הכלכלה הישראלית.'],
			link: '/groups/54825bf7abb7e0355f8ab89f'
		},{
			region: { x: 809, y: 543 },
			irgun: false,
			color: 'blue',
		
			name: 'צוות המאבק על הדיור הציבורי',
			desc: ['צוות הפועל למען שיקום הדיור הציבורי והשמירה על זכויות חסרי הדיור, שכל פתרון דיור אחר אינו בר השגה עבורם.','בארגון פועלים יחד נפגעי/ות הדיור הציבורי, יהודים וערבים ופעילים ופעילות מסייעים.','הפעילות מבוססת על עיקרון הסולידריות, בין הנפגעים לבין עצמם, תוך ניסיון לחזק את יכולת המאבק למען עצמם ולגייס את תמיכת השכנים והקהילות הרלבנטיות.'],
			link: '/groups/54825bf8abb7e0355f8ab8a0'
		},{
			region: { x: 702, y: 457 },
			irgun: false,
			color: 'blue',
		
			name: 'המאבק הירושלמי לדיור ציבורי - המעברה',
			desc: ['קבוצה הנאבקת למען הדיור הציבורי בירושלים.','פועלים מתוך "בית המאבק" לדיור ציבורי הנמצא בבניין כלל בי-ם המהווה מטה להמשך המאבק ובו שוהות המשפחות המפונות מפינסקר, שטרן ופעילים נוספים. בשת"פ עם כוח לעובדים, פורום פריפריה ובית העם.'],
			link: '/groups/54825bfaabb7e0355f8ab8a1'
		},{
			region: { x: 731, y: 596 },
			irgun: false,
			color: 'blue',
		
			name: 'אד"ר - ארגון דרי רחוב',
			desc: ['התארגנות של פעילים חסרי בית הדרים ברחוב ופעילים חברתיים.','מטרת הארגון הנה לתת מענה לצורך של ריכוז ותיאום ההתנהלות מול הרשיות בכל הנושאים שקשורים לחסרי הבית הדרים ברחוב וכן להוות מטריה לתאום בין היוזמות השונות שעוסקות בנושאים הללו.','השם אינו מייצג את הגדרות הרשויות לשם "דר רחוב". מבחינתנו דרי רחוב הם כל האנשים חסרי הבית שמתגורים ברחוב או במיסתורים שונים שאינם מותרים להם על פי החוק.'],
			link: '/groups/54825bfbabb7e0355f8ab8a2'
		},{
			region: { x: 802, y: 452 },
			irgun: false,
			color: 'blue',
		
			name: 'התנועה לחיים בכבוד',
			link: '/groups/54825bfcabb7e0355f8ab8a3',
			desc: ['תנועה היוזמת פעולות מחאה קבוצתיות לעצירת תהליכי פינוי של אזרחים מביתם ויוצרת לחץ על המוסדות הרלוונטיים למציאת פתרון הולם שיאפשר למשפחות אלו קורת–גג.']
		},{
			region: { x: 939, y: 550 },
			irgun: false,
			color: 'blue',
		
			name: 'ישראל יקרה לנו',
			desc: ['התנועה להורדת יוקר המחיה בישראל. קבוצה אקטיביסטית א-מפלגתית העוסקת בנושא יוקר המחיה עם דגש על יוקר מחירי המזון.'],
			link: '/groups/54825bfdabb7e0355f8ab8a4'
		},{
			region: { x: 859, y: 644 },
			irgun: false,
			color: 'blue',
		
			name: 'הגורם האנושי',
			desc: ['קבוצת מאבק נגד התאגידים להחזרת הכח אל הצרכנים.'],
			link: '/groups/54825bfeabb7e0355f8ab8a5'
		},{
			region: { x: 852, y: 863 },
			irgun: false,
			color: 'blue',

			name: 'תנועת המורים - מחנכים. מורים דרך',
			desc: ['תנועה שנועדה להיות גוף ציבורי, המורכב ממורות ומורי ישראל ומשמיע את קולנו בדרך להובלת שינוי ערכי ופדגוגי במערכת החינוך.'],
			link: '/groups/54825bffabb7e0355f8ab8a6'
		},{
			region: { x: 928, y: 921 },
			irgun: false,
			color: 'blue',
		
			name: 'מחאת ההורים - צעדת העגלות',
			desc: ['הדף הרשמי של מחאת ההורים בו מתעדכנים בין היתר מוקדי צעדות בכל הארץ.'],
			link: '/groups/54825c00abb7e0355f8ab8a7'
		},{
			region: { x: 1003, y: 705 },
			irgun: false,
			color: 'blue',
		
			name: 'הקואליציה להעסקה ישירה',
			desc: ['קואליציית ארגונים חברתיים שהתאגדו יחד למאבק למען שיבה להעסקה ישירה בישראל.','אפיקי הפעולה של הקואליציה:','1. מאבק ציבורי לקידום העסקה ישירה.','2. תמיכה בהתאגדויות עובדות ועובדים מופרטים.','3. לובי בכנסת.','4. קידום חקיקה.'],
			link: '/groups/54825c01abb7e0355f8ab8a8'
		},{
			region: { x: 964, y: 817 },
			irgun: true,
			color: 'blue',
		
			name: 'כח לעובדים',
			desc: ['ארגון עובדים כללי המאגד עובדים ממגוון תחומים. הארגון מבוסס על מבנה דמוקרטי שבו הכוח נמצא בידי העובדים.'],
			link: '/groups/54825c02abb7e0355f8ab8a9'
		},{
			region: { x: 500, y: 589 },
			irgun: false,
			color: 'blue',
		
			name: 'צדק משפטי',
			desc: ['קבוצת מחאה נגד עוולות מערכת המשפט.'],
			link: '/groups/54825c03abb7e0355f8ab8aa'
		},{
			region: { x: 466, y: 698 },
			irgun: false,
			color: 'blue',
		
			name: 'ת\' זה תחבורה ציבורית',
			desc: ['קבוצה הפועלת לקידום תחבורה ציבורית ברו"ח המלצות דו"ח טרכטנברג ובתוספת הנושאים: סלילת מסלולים נפרדים לתח"צ בכל רחבי הארץ ואכיפתם.','שיתוף ציבור מלא בתכנון עירוני, הקמת מערך תלונות ומידע ארצי לתחבורה ציבורית.'],
			link: '/groups/54825c05abb7e0355f8ab8ab'
		},{
			region: { x: 563, y: 721 },
			irgun: true,
			color: 'blue',
		
			name: '15 דקות - ארגון צרכני תחבורה ציבורית בישראל',
			desc: ['ארגון הפועל לקיצור זמני הנסיעה בתחבורה הציבורית ולשיפור והוספת שירות בתחבורה הציבורית, כך שהיא תהווה חלופה ראויה לשימוש ברכב הפרטי.','הארגון פועל באמצעות מאבקים ציבוריים ותקשורתיים, בעזרת מתנדבים ואנשי מקצוע.'],
			link: '/groups/54825c06abb7e0355f8ab8ac'
		},{
			region: { x: 619, y: 562 },
			irgun: false,
			color: 'blue',
		
			name: 'המטה הציבורי לשיוויון בבריאות',
			desc: ['רשת של ארגונים ופעילים השותפים בהחלטה הנחושה להביא לצמצום דרסטי של פערי הבריאות בישראל – בין תושבי המרכז לתושבי הפריפריה, בין העניים לעשירים, בין ערבים ליהודים, בין עולי אתיופיה לציבור הישראלי הותיק ועוד.','הארגונים והפעילים השותפים למטה מעורבים במאבקים וביוזמות מגוונות – כל אחד ואחת פועלים בדרכם שלהם – למען מטרה זו, ואולם כולנו יחד קוראים לממשלה לקבל החלטה אמיצה לכונן תכנית לאומית רב שנתית לצמצום הפערים בבריאות, תוך התבססות על יעדים כמותיים.'],
			link: '/groups/54825c07abb7e0355f8ab8ad'
		},{
			region: { x: 793, y: 992 },
			irgun: false,
			color: 'blue',
		
			name: 'תנועת עתידנו',
			desc: ['תנועה ששמה לה למטרות לקדם מאבק על שיפור תנאי השכר של העובדות/ים הסוציאליות/יים, לעצור את הפגיעה שגורמת הפרטת השירותים החברתיים בעובדות/ים ובלקוחות ולהילחם על מעמדו ועתידו של המקצוע.'],
			link: '/groups/54825c08abb7e0355f8ab8ae'
		},{
			region: { x: 734, y: 843 },
			irgun: false,
			color: 'blue',
		
			name: 'עוסי"ם שינוי',
			desc: ['עמותה ארצית של סטודנטים לעבודה סוציאלית, אשר נוסדה במטרה לקחת אחריות כלפי מקצוע העבודה הסוציאלית. מתוך הבנה אודות חשיבותה של מדיניות רווחה נאותה בישראל.'],
			link: '/groups/54825c09abb7e0355f8ab8af'
		},{
			region: { x: 649, y: 807 },
			irgun: false,
			color: 'blue',
		
			name: 'רשת ביטחון חברתי',
			desc: ['עמותה שמטרתה להקים רשת קהילות סיוע מחוללות-שינוי ברחבי ישראל.','זאת, באמצעות מודל ייחודי שפיתחה, המעניק סיוע רב-מערכתי, פרטני וקהילתי לאנשים שאיבדו את יכולת ההתמודדות עם המציאות החברתית והכלכלית בישראל.'],
			link: '/groups/54825c0aabb7e0355f8ab8b0'
		},{
			region: { x: 617, y: 988 },
			irgun: false,
			color: 'blue',
		
			name: 'תרומות ומעשים טובים',
			desc: ['קבוצת שנפתחה על מנת לעזור למשפחות נזקקות ולכאלה שידם אינה משגת.','זוהי לא קבוצת מסירות רגילה והמטרה שלה היא שהתרומות שנמסרות בה יועברו לנזקקים בלבד.'],
			link: '/groups/54825c0babb7e0355f8ab8b1'
		},{
			region: { x: 567, y: 916 },
			irgun: false,
			color: 'blue',
		
			name: '"דברים שצריך" - ספריית חפצים שיתופית',
			desc: ['פרוייקט צרכנות שיתופי ליצירת ספריית חפצים קהילתית. הספרייה תעסוק ב-2 מערכי השאלות חפצים:','1. מערך שיתוף חפצים בין מנויים.','2. השאלת חפצים של הספרייה לציבור הרחב.','הקו המנחה את החשיבה בפרויקט הספרייה השיתופית "דברים שצריך" הוא "Strategic Access" - הנגשה אסטרטגית. מונח זה מכוון ליצירת נגישות מקסימלית למוצרים וחפצים על ידי בחינה של תדירות ופרק זמן הצריכה על פי צרכים ורצונות משתנים.'],
			link: '/groups/54825c0cabb7e0355f8ab8b2'
		},{
			region: { x: 707, y: 1000 },
			irgun: false,
			color: 'blue',
		
			name: 'בנק הזמן',
			desc: ['בנק הזמן מושתת על הרעיון בו אנשים "מפקידים" את זמנם בבנק ע"י מתן עזרה לאחרים בתחומים מגוונים ו"פודים" את זמנם כאשר הם צריכים שמשהו ייעשה למענם.','בבנק אין "מתנדבים" אלא "תורמי זמן" ו"מקבלי זמן".'],
			link: '/groups/54825c0dabb7e0355f8ab8b3'
		},{
			region: { x: 562, y: 827 },
			irgun: false,
			color: 'blue',
		
			name: 'קיימנים - פעילים בסביבה',
			desc: ['תכנית קיימות חברתית במיקוד באורבניות, רשת וצרכנות לסטודנטים וקבוצות.'],
			link: '/groups/54825c0fabb7e0355f8ab8b4'
		},{
			region: { x: 482, y: 879 },
			irgun: false,
			color: 'blue',
		
			name: 'O-Share אושר‎',
			desc: ['פלטפורמה חינמית לשיתוף זמן, חפצים, מזון וידע בעזרת מטבע פנימי "שפע~"'],
			link: '/groups/54825c10abb7e0355f8ab8b5'
		},{
			region: { x: 1272, y: 1299 },
			irgun: false,
			color: 'green',
		
			name: 'הפורום הישראלי לשמירה על החופים',
			desc: ['התארגנות ארצית של מטות מאבקים מקומיים להצלת חופים מפני תכניות בנייה הרסניות.','הפורום פועל כרשת של חברים ובשיתוף פעולה עם הארגונים הסביבתיים-חברתיים: אדם טבע ודין, עמותת כחול וירוק, ארגון מגמה ירוקה, החברה להגנת הטבע, צלול, חיים וסביבה, גרינפיס ועוד.'],
			link: '/groups/54825c11abb7e0355f8ab8b6'
		},{
			region: { x: 876, y: 1142 },
			irgun: false,
			color: 'green',
		
			name: 'משאירים את הגז בישראל',
			desc: ['קבוצת מאבק נגד ייצוא הגז הטבעי שנמצא ליד חופי ישראל ובעד השבת משאבי הטבע לידי האזרחים.'],
			link: '/groups/54825c12abb7e0355f8ab8b7'
		},{
			region: { x: 1005, y: 1277 },
			irgun: false,
			color: 'green',
		
			name: 'א\' זה אסדה - מעבירים את מפעלי הגז לים',
			desc: ['מאבק נגד  מתקני הגז היבשתיים ודרישה שאספקת הגז למדינה תעשה על ידי הזרמתו מאסדה צפה מרוחקת בלב הים לתוך מערכת ההולכה התת ימית הקיימת.'],
			link: '/groups/54825c13abb7e0355f8ab8b8'
		},{
			region: { x: 1183, y: 1255 },
			irgun: true,
			color: 'green',
		
			name: 'מגמה ירוקה',
			desc: ['עמותת המתנדבים הסביבתית הגדולה בארץ, המקדמת שינוי סביבתי באמצעות אקטיביזם ופיתוח מנהיגות סביבתית.'],
			link: '/groups/54825c14abb7e0355f8ab8b9'
		},{
			region: { x: 1149, y: 1144 },
			irgun: false,
			color: 'green',
		
			name: 'אדממא',
			desc: ['מיזם העוסק באקולוגיה מעשית, בנייה מחומרים טבעיים, קומפוסט, אקולוגיה אנושית, מחזור נייר ופסולת, גינון אורגני וכיבוד האדמה ע’’פ עקרונות הטבע ואורח חיים הרמוני.','אנחנו מעבירים שלל רחב של קורסים בנושאי אקולוגיה, פסולת אורגנית, מחזור, מערכת מים אפורים, מלאכות מחומרים טבעיים, בנייה בבוץ, איך להכין קומפוסט בייתי, גינון אורגני של גינה אקולוגית ובמילה אחת- פרמקלצ’ר.'],
			link: '/groups/54825c15abb7e0355f8ab8ba'
		},{
			region: { x: 919, y: 1223 },
			irgun: false,
			color: 'green',
		
			name: '"שקט תעשייתי - אזרחים למען הסביבה"',
			desc: ['התארגנות המורכבת משני ארגונים: אזרחים למען הסביבה, והקואליציה לבריאות הציבור - שפועלים באזור חיפה והצפון כבר למעלה מ 10 שנים.','בעקביות ובשיטתיות אנחנו אוספים מידע כדי להפחית את הזיהום הסביבתי בכלל ואת התעשייתי בפרט.','את המידע שאנחנו אוספים אנו מנתחים ומפרסמים בסדרת דו"חות תחת הכותרת שקט תעשייתי.'],
			link: '/groups/54825c16abb7e0355f8ab8bb'
		},{
			region: { x: 964, y: 1003 },
			irgun: false,
			color: 'green',
		
			name: 'מצילים את חוף נחשולים וחופי הכרמל',
			desc: ['מחאה שהחלה בעקבות תוכנית לבניית כפר נופש לעשירים ליד חוף נחשולים ומהר מאוד התרחבה למחאה על כל חופי הכרמל הנמצאים כיום בסכנת פיתוח/בנייה.'],
			link: '/groups/54825c17abb7e0355f8ab8bc'
		},{
			region: { x: 1088, y: 1229 },
			irgun: true,
			color: 'green',
		
			name: 'אנונימוס לזכויות בעלי חיים',
			desc: ['"עמותה ללא מטרות רווח, שנוסדה בשנת 1994, המבוססת בעיקר על מתנדבים. העמותה ממומנת מכספי תרומות – מאנשים פרטיים ומקרנות.','ביכולתך לסייע לנו בארגון או במימון פעילות נרחבת יותר שתגדיל את כוח השפעתנו על מקבלי החלטות, צרכנים, כלי תקשורת - וגורמים נוספים שגורל מאות מיליוני בעלי-חיים נתון בידיהם.'],
			link: '/groups/54825c19abb7e0355f8ab8bd'
		},{
			region: { x: 1084, y: 1326 },
			irgun: false,
			color: 'green',
		
			name: '269Life Israel',
			desc: ['269life היא תנועה בינלאומית לשחרור בעלי חיים.','נקודת המוצא הבסיסית של התנועה היא הדרישה הבלתי מתפשרת לשחרור בעלי החיים –אין ולא יהיה כלוב גדול דיו, או להב חד מספיק, בכדי להצדיק כל תעשייה שהיא העושה רווח על גבם.'],
			link: '/groups/54825c1aabb7e0355f8ab8be'
		},{
			region: { x: 432, y: 967 },
			irgun: false,
			color: 'aqua',
		
			name: 'צדק חברתי לגיל השלישי',
			desc: ['קבוצה הפועלת במטרה לשים את הגיל השלישי על המפה, להתאגד יחד לפעולות אפקטיביות בנושאים שחשובים לנו, להשפיע על מקבלי ההחלטות ולשנות את החקיקה בתחומים הנוגעים לחיינו.'],
			link: '/groups/54825c1babb7e0355f8ab8bf'
		},{
			region: { x: 331, y: 964 },
			irgun: false,
			color: 'aqua',
		
			name: 'לא נחמדים - לא נחמדות',
			desc: ['קבוצת שטח של פעילי שכונות ופריפריה הפועלת במטרה לצמצם את הפערים החברתיים-כלכליים ולבטל את מושג הפריפריה מהשיח הציבור.י'],
			link: '/groups/54825c1cabb7e0355f8ab8c0'
		},{
			region: { x: 244, y: 976 },
			irgun: true,
			color: 'aqua',
		
			name: 'התחברות - תארבוט  – تـــرابـــط',
			desc: ['תנועה יהודית-ערבית, למען שיוויון חברתי, פיתוח עירוני, דיור ציבורי, הכרה בכפרים הבלתי מוכרים בנגב, למען זכויות תושבים, נגד הריסות בתים ונישול ועוד.'],
			link: '/groups/54825c1dabb7e0355f8ab8c1'
		},{
			region: { x: 154, y: 1131 },
			irgun: false,
			color: 'aqua',
		
			name: 'מצילים את הניצולים',
			desc: ['קבוצה הנלחמת על הכספים שנגזלו מניצולי השואה ועל התהליך המסורבל לקבלתו.','הקבוצה קוראת לממשלת ישראל לסיים את המבוך הבירוקרטי לטפל מידית במצבם של הניצולים.'],
			link: '/groups/54825c1eabb7e0355f8ab8c2'
		},{
			region: { x: 63, y: 1141 },
			irgun: false,
			color: 'aqua',
		
			name: 'מאבק החד הוריות',
			desc: ['מאבק המתמקד בתיקוני חקיקה וחסמי השתכרות לאמהות לאחר גירושין/פירוק התא המשפחתי, במקרים בהם האב חדל לקחת אחריות הורית על ילדיו.'],
			link: '/groups/54825c1fabb7e0355f8ab8c3'
		},{
			region: { x: 72, y: 872 },
			irgun: false,
			color: 'aqua',
		
			name: 'א\' זה אבא',
			desc: ['ארגון המקדם את המודעות החברתית תקשורתית בנושא הכי מודחק בחברה ונאבק בשם האבות הגרושים למען שוויון הורי במדינת ישראל.'],
			link: '/groups/54825c20abb7e0355f8ab8c4'
		},{
			region: { x: 343, y: 718 },
			irgun: false,
			color: 'aqua',
		
			name: 'קואליציית הורים לילדים מיוחדים',
			desc: ['הקואליציה פועלת בכמה מישורים במקביל:','פעילות בכנסת כארגון חברתי אזרחי לקידום חקיקה בנושא.','קידום חקיקת חוק המשפחות המיוחדות שלראשונה, אם יעבור, יביא להכרה וזכויות לכל המשפחה כמשפחה עם צרכים מיוחדים ולא רק לילד עצמו.','שינוי חוקים קיימים או הוספת תיקונים לחוקים קיימים.','הסברה לגורמים בתוך מערכת החינוך, סטודנטים לחינוך, לציבור הכללי ולציבורים ספציפיים על ציבור המשפחות המיוחדות. על הילדים המיוחדים וההתמודדויות והקשיים שלהם.','הורים שנתקלים בקשיים מקשיים שונים פונים לקואליציה ומקבלים עזרה מהורים אחרים שפעילים בקואליציה או מופנים לארגונים ועמותות אחרות שיכולות לעזור.'],
			link: '/groups/54825c21abb7e0355f8ab8c5'
		},{
			region: { x: 338, y: 1055 },
			irgun: false,
			color: 'aqua',

			name: 'נשים אומרות חלאס! النساء تقول خلص!',
			desc: ['קבוצה שנועדה לאגד את הקול הנשי במזה"ת, להשתמש בכוחנו העצום (הוא עצום!) לבלימת הלחימה ולעודד מסר של שיח ושל שלום. הקבוצה פתוחה לנשים בלבד :-) ודרושות מתרגמות לבביות עם מקלדת דו לשונית...','هذه المجموعة مخصصة لتوحيد الصوت النسائي ، لنستعمل قوتنا العظيمة ، لوقف القتال ولتشجيع التفاهم عن طريق الكلام والسلام بين الطرفين. المجموعة مفتوحة للنساء فقط. ومطلوب مترجمات ذوات تمكن من اللغتين'],
			link: '/groups/54825c22abb7e0355f8ab8c6'
		},{
			region: { x: 383, y: 888 },
			irgun: true,
			color: 'aqua',

			name: 'הקשת הדמוקרטית המזרחית',
			desc: ['תנועה חברתית על-מפלגתית וחוץ פרלמנטרית, שמטרתה להשפיע על סדר היום הציבורי, מתוך כוונה להביא לשינוי כולל של החברה הישראלית ומוסדותיה השונים.','היוזמה להקמת התנועה באה מקרב נשים וגברים בני ובנות הדור השני והשלישי של יהודי ארצות ערב והמזרח.'],
			link: '/groups/54825c24abb7e0355f8ab8c7'
		},{
			region: { x: 252, y: 746 },
			irgun: true,
			color: 'aqua',

			name: 'תנועת אחותי',
			desc: ['ארגון פמיניסטי מזרחי הפועל בכל הארץ עם נשים שאינן נכללות בהגמוניה החברתית לקדם את נראותן.','התנועה שמה לה למטרה לקדם בסדר היום הציבורי נושאים של צדק חברתי וכלכלי מתוך תפיסה פמיניסטית רחבה הכורכת יחד אתניות, זהות ומעמד, לאומיות ומגדר.'],
			link: '/groups/54825c25abb7e0355f8ab8c8'
		},{
			region: { x: 258, y: 1111 },
			irgun: true,
			color: 'aqua',

			name: 'שומרי משפט- רבנים למען זכויות אדם',
			desc: ['ארגון המשמיע את קולה של המסורת היהודית בתחום זכויות האדם. הארגון נוסד בשנת תשמ"ט (1988) ומונה כיום כמאה חברים – רבנים מוסמכים וסטודנטים לרבנות.'],
			link: '/groups/54825c26abb7e0355f8ab8c9'
		},{
			region: { x: 87, y: 687 },
			irgun: false,
			color: 'aqua',
		
			name: 'המטה למאבק בגזענות',
			desc: ['ארגונים חברתיים ואנשים פרטיים, הפועלים יחד ומגיבים על מסרים, פעילויות, חומרים וביטויים אשר יש בהם משום אפליה, רדיפה, השפלה, ביזוי, גילוי איבה, עוינות, אלימות או גרימת מדנים כלפי אדם, ציבור או חלקים של האוכלוסייה, והכול בשל צבע, השתייכות לגזע, לדת, לקבוצה לאומית-אתנית או בשל ארץ מוצא או מוצא עדתי.'],
			link: '/groups/54825c27abb7e0355f8ab8ca'
		},{
			region: { x: 150, y: 963 },
			irgun: false,
			color: 'aqua',
		
			name: 'רופאים לזכויות אדם',
			desc: ['ארגון הפועל למען זכויות אדם בכלל והזכות לבריאות בפרט, בישראל ובשטחים הכבושים.','דרכי פעולה: ייצוג פרטני, מאבק עקרוני, טיפול רפואי. בין השאר משתדלים לספק חברי העמותה עזרה רפואית לעובדים זרים ופליטים בלוינסקי.'],
			link: '/groups/54825c28abb7e0355f8ab8cb'
		},{
			region: { x: 60, y: 964 },
			irgun: false,
			color: 'aqua',
		
			name: 'עמותת ידיד',
			desc: ['עמותה הפועלת למען תמיכה והעצמת שכבות חלשות בחברה הישראלית והגברת הסולדיריות החברתית.','פועלים בערים: קרית שמונה חצור הגלילית, צפת, נצרת, נצרת עילית, סחנין, חיפה, תל מונד, תל אביב, פתח תקוה, אשדוד, אשקלון, אופקים, שדרות, רהט, דימונה, ירושלים, קרית מלאכי, שפיר, נהורה וקרית גת.'],
			link: '/groups/54825c29abb7e0355f8ab8cc'
		},{
			region: { x: 59, y: 782 },
			irgun: false,
			color: 'aqua',
		
			name: '6 צבעים - בונים קהילה גאה בישראל',
			desc: ['עמותה העוסקת בבניית הקהילה הגאה בישראל, על ידי חיבור בין אנשים והעשרת המודעות הקהילתית. אנו מאמינים שתשתית קהילתית חזקה תשפר את אופי חיינו כטרנסג\'נדרס, ביסקסואלים, לסביות והומואים בישראל, ותאפשר לנו כקהילה, להוביל את השינוי החברתי בישראל.','במסגרת הפעילות הקהילתית שאנו מקדמים - דיונים על אסטרטגיה קהילתית, טלויזיה קהילתית, הכשרת מדריכי קבוצות והעשרה לפעילים לשינוי חברתי, ספורט ותרבות גאה, קבוצות מפגש חברתיות, טיולים ועוד.'],
			link: '/groups/54825c2aabb7e0355f8ab8cd'
		},{
			region: { x: 191, y: 1053 },
			irgun: false,
			color: 'aqua',
		
			name: 'טבקה',
			desc: ['טבקה ("עושה צדק" באמהרית) קמה, במטרה לסייע להשתלבותם המוצלחת של עולי אתיופיה בחברה הישראלית.','מיום הקמתה פועלת טבקה לקידום מדיניות שוויונית וסובלנית ומנהלת מאבק עיקש על מנת לעקור מהשורש תופעות של אפליה וגזענות. העמותה מגינה על זכויות העולים ובונה את חוסנה החברתי של קהילת יוצאי אתיופיה.'],
			link: '/groups/54825c2babb7e0355f8ab8ce'
		},{
			region: { x: 116, y: 603 },
			irgun: false,
			color: 'aqua',
		
			name: 'סולידריות',
			desc: ['תנועה פוליטית-חברתית הנאבקת למען סיום הכיבוש ולמען שוויון אזרחי.','סולידריות מחויבת לשיתוף פעולה יהודי-ערבי במאבקי שטח מקומיים כנגד נישול ואפליה מתוך אמונה ביכולתה של חלקת הארץ שבין הירדן לים להקנות לכל תושביה הזדמנות שווה לכבוד-עצמי וחירות פוליטית.'],
			link: '/groups/54825c2cabb7e0355f8ab8cf'
		},{
			region: { x: 93, y: 1055 },
			irgun: true,
			color: 'aqua',
		
			name: 'עמותת איתך مَعَك(מעכי)- משפטניות למען צדק חברתי',
			desc: ['ארגון הפועל להשמעת קולן של נשים ונערות בזירה המשפטית מדינית, פמיניסטית וקהילתית.','העמותה פועלת לקידום גישה מגדרית רב תרבותית בכל מערכות החוק והשלטון ובמוקדי קבלת החלטות. לעמותה שלושה סניפים - חיפה, באר שבע ותל אביב.'],
			link: '/groups/54825c2eabb7e0355f8ab8d0'
		},{
			region: { x: 275, y: 645 },
			irgun: false,
			color: 'aqua',
		
			name: 'הפורום למאבק בעוני',
			desc: ['פורום הפועל בישראל משנת 2009. הפורום עוסק בהעלאת המודעות לאנשים החיים בעוני, בהנהגת פרופ\' יונה רוזנפלד, חתן פרס ישראל לעבודה סוציאלית.','מטרת הפורום הינה להשמיע את קולם של אנשים החיים בעוני ולקדם מדיניות חברתית המבוססת על דיאלוג מתמשך עם אנשים החיים בעוני.'],
			link: '/groups/54825c2fabb7e0355f8ab8d1'
		},{
			region: { x: 183, y: 676 },
			irgun: true,
			color: 'aqua',
		
			name: 'מען',
			desc: ['איגוד עובדים עצמאי, המאגד עובדים ללא הבדלי לאום, דת, מין או מקצוע. פועל לארגן את הפועלים הבלתי מאורגנים, המהווים יותר משני שליש מכוח העבודה בישראל.'],
			link: '/groups/54825c30abb7e0355f8ab8d2'
		},{
			region: { x: 672, y: 1337 },
			irgun: false,
			color: 'yellow',
		
			name: 'ועד שוכרי הדירות של ישראל',
			desc: ['ועד שקם במטרה לשפר את חיי שוכרי הדירות, בכל התחומים.','אנו עוסקים בחקיקה, ועובדים עם מספר חברי כנסת וגורמים נוספים על מנת לקדם הצעות חוק הנוגעות באופן ישיר לשוק השכירות בישראל.','אנו עוסקים בקידום יוזמות עירוניות שנועדו לתת מענה לבעיות הייחודיות של השוכרים בכל מקום. אנו עוסקים גם בשיפור היחסים בתוך שוק השכירות- בין שוכר למתווך, בין שוכר לבעל דירה ובין שוכר לשוכר אחר. העשייה רבה ונשמח אם תצטרפו אלינו. כל מי שרוצה לקחת חלק פעיל במאבק מוזמן לשלוח לנו הודעה.'],
			link: '/groups/54825c31abb7e0355f8ab8d3'
		},{
			region: { x: 520, y: 1035 },
			irgun: false,
			color: 'yellow',
		
			name: 'הקואליציה לדיור בר השגה',
			desc: ['קואליציה של ארגונים חברתיים ואקדמיים לפתרון מצוקת הדיור.','הקואליציה מציעה חשיבה חדשה על בעיית הדיור בישראל ופניה אל פתרונות מקוריים, שיתנו מענה הן למחסור בדיור בר השגה והן לצורך בשילוב בין אוכלוסיות בעלות הכנסה שונה באותה סביבת מגורים (יצירת תמהיל חברתי).'],
			link: '/groups/54825c32abb7e0355f8ab8d4'
		},{
			region: { x: 418, y: 1167 },
			irgun: false,
			color: 'yellow',
		
			name: 'ברית הקואופרטיבים לצדק חברתי, כלכלי וסביבתי',
			desc: ['ברית המאגדת קואופרטיבים ויוזמות שיתופיות הפועלות על פי עקרונות הקואופרציה ופועלת לקידום רוח הכלכלה הדמוקרטית ככלי לשינוי חברתי פרוגרסבי.','הברית והחברות המאוגדות בה רואות בקואופרציה כאקט של אקטיביזם כלכלי ופועלות לקידום חזון של כלכלה הוגנת ובריאה המותאמת למאה ה-21.'],
			link: '/groups/54825c33abb7e0355f8ab8d5'
		},{
			region: { x: 320, y: 1293 },
			irgun: false,
			color: 'yellow',
		
			name: 'קואופרטיב תוכנה תל אביב',
			desc: ['קואופרטיב תוכנה פרמטק PermaTech.Coop אגודה שיתופית של מפתחי תוכנה ובעלי מקצועות נלווים אנחנו מספקים שירותי פיתוח תוכנה ויוצרים אפליקציות רשת ומובייל עבור ארגונים חברתיים ועסקיים.','מייסדי החברה הם קבוצת מומחי תוכנה וטכנולוגיות מידע, עם ניסיון מוכח בהקמת חברות סטארטאפ ובתפקידי ניהול טכנולוגי, פיתוח אלגוריתמים, הנדסת תוכנה, ניהול תשתיות מיחשוב, פיתוח אתרים ואפליקציות, וניהול מדיה ברשת.'],
			link: '/groups/54825c34abb7e0355f8ab8d6'
		},{
			region: { x: 357, y: 1373 },
			irgun: false,
			color: 'yellow',
		
			name: 'קואופרטיב תוכנה כרמל (צפון)',
			link: '/groups/54825c35abb7e0355f8ab8d7',
			desc: ['חברה המספקת פתרונות ושירותי פיתוח מקצועיים. בין לקוחותינו עסקים קטנים ובינוניים, מוסדות במגזר הציבורי וכן ארגונים במגזר השלישי.','אנו מתמחים בפיתוח פתרונות כוללים בצמוד ללקוח ובהתאמה אישית לצרכיו: למידת צרכי העסק, אפיון מדויק של הפתרון,פיתוח מהיר, הטמעה, ותמיכה.','הפיתוח מבוצע על ידי צוות מנוסה, שלחבריו יכולות מקצועיות מגוונות. שביעות הרצון שלך היא המחוייבות המקצועית שלנו.']
		},{
			region: { x: 786, y: 1177 },
			irgun: false,
			color: 'yellow',
		
			name: 'המפלצת בר קפה קואופרטיב',
			desc: ['בר-קפה שכונתי: עסק עצמאי, בבעלות לקוחותיו ועובדיו. פאב בו מכירים את השכנים, עם מוסיקה, תרבות וקהילה.','הפתיחה מתוכננת לסתיו הקרוב בשכונת קרית יובל שבירושלים. לאורך הקיץ אנו מקיימים אירועים, דוכנים ומפגשים ונשמח אם תצטרפו אלינו. באירועים אנו מספרים על המפלצת, ומזמינים את כל מי שתומכים ברעיון להצטרף כחברים, לרכוש מנייה ולהיות שותפים בהקמה.'],
			link: '/groups/54825c36abb7e0355f8ab8d8'
		},{
			region: { x: 512, y: 1132 },
			irgun: false,
			color: 'yellow',
		
			name: 'הקואופרטיב האורגני של דרום תל אביב',
			desc: [' גוף שהוקם למטרת קניות משותפות של ירקות ומוצרים אורגניים, ישירות מהמגדלים במחירים שווים לכל נפש.','את הקואופ מרכיבים היום כ-70 בתים (במקומות אחרים אומרים "משפחות", אבל אצלנו זה בעיקר דירות שותפים, זוגות צעירים ורווקים) שקונים ביחד ירקות, פירות ומוצרים אורגניים.'],
			link: '/groups/54825c38abb7e0355f8ab8d9'
		},{
			region: { x: 505, y: 1270 },
			irgun: false,
			color: 'yellow',
		
			name: 'קואופ גרילה',
			desc: ['קואופ בו כל חבר מוזמן להיות גם ספק קטן. החברים מוזמנים ליצור קשר קשר עם יצרנים קטנים או לייצר בעצמם ולשווק תוצרת איכותית ובריאה לחברים.','הגיע הזמן שנתחיל לדאוג לעצמנו ולקחת אחריות על החיים והמזון שלנו כי האמת היא שאף אחד אחר לא עושה את זה במקומנו.'],
			link: '/groups/54825c39abb7e0355f8ab8da'
		},{
			region: { x: 693, y: 1093 },
			irgun: false,
			color: 'yellow',
		
			name: 'שלנו',
			desc: ['הקואופרטיב הראשון לשינוי חברתי כלכלי. קואופרטיב שנוסד על ידי יוצאי מאהל נורדאו בעקבות המחאה החברתית וכמענה לה במטרה, להוריד את יוקר המחיה לחבריו ולכלל האזרחים במדינה.','"המחאה לימדה אותנו את כוח הקבוצה, והבנו שעל מנת ליצר שינוי בר קיימא חייבים ליצור אלטרנטיבה. אלטרנטיבה שתספק את מוצרי היסוד שלנו בתחום המזון, החינוך, הבנקאות והביטוח, שנדע שתמיד תפעל לטובתנו, בשקיפות ובדמוקרטיה. אלטרנטיבה שתהיה שלנו. הגיע הזמן לשנות את המציאות – "שלנו".'],
			link: '/groups/54825c3aabb7e0355f8ab8db'
		},{
			region: { x: 240, y: 1256 },
			irgun: false,
			color: 'yellow',
		
			name: 'הבנק הקואופרטיבי אופק',
			desc: ['אופק - אגודה שיתופית לניהול הון בע"מ, נוסדה ביוני 2012 כדי להקים את הבנק הקואופרטיבי הישראלי הראשון.','אופק שמה לעצמה למטרה להוות אלטרנטיבה בענף הבנקאות בישראל באמצעות מתן שירותים מותאמים, בעלות נמוכה, ללקוחות פרטיים ולעסקים קטנים. מודל העבודה של אופק מושתת על מודלים שזוכים להצלחה רבה ברחבי העולם המערבי.'],
			link: '/groups/54825c3babb7e0355f8ab8dc'
		},{
			region: { x: 428, y: 1073 },
			irgun: false,
			color: 'yellow',
		
			name: 'נתיבות גרופ',
			desc: ['קבוצת הרכישה אשר הוקמה בעקבות הבנה כי יש לצרכנים בנתיבות ובכלל כוח צרכני אדיר שבו טמון פוטנציאל להוזלת מחירים משמעותית של מוצרי צריכה בפרט ויוקר המחיה בכלל.'],
			link: '/groups/54825c3cabb7e0355f8ab8dd'
		},{
			region: { x: 867, y: 1351 },
			irgun: false,
			color: 'yellow',
		
			name: '"עגלה", צרכנייה קואופרטיבית במצפה רמון',
			desc: ['קואופרטיב צרכנים, מצפה רמון.'],
			link: '/groups/54825c3dabb7e0355f8ab8de'
		},{
			region: { x: 409, y: 1259 },
			irgun: false,
			color: 'yellow',
		
			name: 'הבר קיימא',
			desc: ['פאב-מסעדה טבעוני בבעלות קואופרטיבית.','הבר-קיימא (שנפתח ביולי 2012) הוא יצירה משותפת של מאות בעלים/ות שווים/ות.','ההופעות, ההרצאות, העיצוב, השיווק, האוכל, התפעול ובעצם כל מה שאתם יכולים לראות ולפגוש בבר נוצר על ידי חברי וחברות הקופראטיב, בתהליך של למידה וקבלת החלטות משותפת.','המקום נוצר מתוך אמונה משותפת בערכים של קיימות, קהילה ורצון לשנות את העולם בו אנו חיים.','דלתות הבר-קיימא פתוחות באהבה לכולם, גם אם אתם לא חברי הקופראטיב. אם אתם רוצים להיות שותפים, אתם מוזמנים בשמחה להצטרף לאגודה ולהיות בעצמכם השינוי שאתם רוצים לראות בעולם.'],
			link: '/groups/54825c3eabb7e0355f8ab8df'
		},{
			region: { x: 770, y: 1356 },
			irgun: false,
			color: 'yellow',
		
			name: 'קו יוגה',
			desc: ['מרכז יוגה חדש ובו מגוון שיעורים במחירים נוחים ונמוכים.','המרכז נמצא ב\'מקום לשבט\', מיסודו של הפאב מסעדה טבעונית ה\'בר קיימא\', ברחוב המשביר 22 בשכונת פלורנטין.','לאור המצב בשוק, שבו מרכזים ליוגה נסגרים או נשחקים תחת נטל ההוצאות, חברו ארבעה מורים ליוגה; אורי בן-דב, נילי לנדסמן, אביטל ברק ועתליה מוסקונה- לרמן, בכדי לייסד אופציה אחרת- הוגנת יותר, לכל הצדדים.','חלומנו העתידי הוא להקים קואופרטיב יוגה שבו יהיו שותפים מורים ותלמידים, אשר יפעל על פי עקרונות של שיתוף וסולידריות, מתוך מחשבה על מודל כלכלי חדש.','כחלק מתהליך ההתהוות של הקואפרטיב שלנו, חברנו אל אנשי ה\'בר קיימא\', והם מארחים אותנו בגלריה המשופצת והיפה שמעל המסעדה.'],
			link: '/groups/54825c3fabb7e0355f8ab8e0'
		},{
			region: { x: 603, y: 1276 },
			irgun: false,
			color: 'yellow',
		
			name: 'קפה חברותא',
			desc: ['בית קפה פוליטי עצמאי, הפותח דלת לחיי חירות, קהילה ותרבות בלב קריית שמונה ואצבע הגליל.','קפה חברותא פועל בצורה דמוקרטית - שיתופית, למטרות רווחת השותפים, האורחים ותושבי האזור. חברותא נמצאת בלב כּיכר העיר .מטרות \'חַבְרוּתָא\':','1. הפיכת קרית שמונה והאיזור למרחב דמוקרטי שבו לכל האזרחים תהיה אפשרות שווה להשפיע.','2. עידוד יוזמות כלכליות מקיימות, חברתיות, תרבותיות ומחאתיות ברוח דמוקרטית.','3.יצירת מרחבים גשמיים המקדמים ומאפשרים כינוס ופעילות לשיח פוליטי חברתי ותרבותי ומחאתי.','4. עידוד הימנעות מהשתתפות בפעילות דכאנית, אלימה או נצלנית.','5. הנאה .... כמה שיותר.'],
			link: '/groups/54825c40abb7e0355f8ab8e1'
		},{
			region: { x: 544, y: 1355 },
			irgun: false,
			color: 'yellow',
		
			name: 'קואופרטיב בשותף - ירושלים',
			desc: ['הוקם על-ידי חבורת צעירים וצעירות ירושלמים, ביניהם סטודנטים, משפחות צעירות המתגוררות באיזור מרכז העיר.','הקואופרטיב שואף לצמיחה הדרגתית ולהצטרפות מתמדת ומתונה של חברים חדשים, כדי שבסופו של דבר נהפוך לקבוצה גדולה של חברים, שתהווה כוח קנייה משמעותי בעיר. כך נוכל לבטא ולקדם את הערכים והאינטרסים החברתיים שלנו בדרך יעילה אך גם הוגנת.'],
			link: '/groups/54825c41abb7e0355f8ab8e2'
		},{
			region: { x: 784, y: 1091 },
			irgun: false,
			color: 'yellow',
		
			name: '"בידיים"',
			desc: ['פרוייקט וירטואלי שמקדם קיימות בסגנון עשה-זאת-בעצמך ומחזיר את האחריות על הצריכה בכל רבדי החיים לאזרחים.'],
			link: '/groups/54825c43abb7e0355f8ab8e3'
		},{
			region: { x: 320, y: 1200 },
			irgun: false,
			color: 'yellow',
		
			name: 'יוגה בגליל',
			desc: ['מכז לתרגול יוגה במחירים שווים לכל נפש בזכות היותו בנוי על התאגדות מורים ליוגה המחזיקים את המקום יחדיו.','מרכז היוגה יהיה בית לזרמי יוגה רבים, יאפשר שעות תרגול ושיעורים בימים מגוונים וכן ייתן מענה לצרכים שונים באוכלוסייה.'],
			link: '/groups/54825c44abb7e0355f8ab8e4'
		},{
			region: { x: 831, y: 1269 },
			irgun: false,
			color: 'yellow',
		
			name: 'קואופרטיב כפר סאלד',
			desc: ['קואופרטיב שמטרתו להשיג מזון איכותי, מקומי ואורגני, במחירים שפויים ובדרכים אשר מטפחות סביבה בריאה לכולם, תוך כדי יצירת קהילה תוססת ושמחה.'],
			link: '/groups/54825c45abb7e0355f8ab8e5'
		},{
			region: { x: 450, y: 1352 },
			irgun: false,
			color: 'yellow',
		
			name: '"מקום לשבט"',
			desc: ['מרכז מפגש וקהילה מעל הבר-קיימא.'],
			link: '/groups/54825c46abb7e0355f8ab8e6'
		},{
			region: { x: 734, y: 1265 },
			irgun: false,
			color: 'yellow',
		
			name: 'הבד קיימא',
			desc: ['יריד החלפות שמטרתו להוות אלטרנטיבה נבונה וחסכונית לצרכנות הקיימת.','לכולנו יש דברים שאנחנו צריכים, ולכולנו יש הרבה דברים שכבר אין לנו צורך בהם. במקום שייתפסו מקום בבית או ימצאו את עצמם ברחוב, למה לא להעביר אותם הלאה ובמקביל להתחדש במה שנחוץ לנו?'],
			link: '/groups/54825c47abb7e0355f8ab8e7'
		},{
			region: { x: 357, y: 184 },
			irgun: false,
			color: 'bordo',
		
			name: 'גבעת עמל - נלחמים על הבית',
			desc: ['עמוד המעדכן על התקדמות במאבק המשפטי והציבורי של המשפחות, נארגן הפגנות במידת הצורך, והכי חשוב, נביא לכם את הסיפור האישי של כל משפחה על מנת שתבינו את גודל העוולה שהתבצעה כאן בשיתוף העירייה והמדינה!'],
			link: '/groups/54825c48abb7e0355f8ab8e8'
		},{
			region: { x: 399, y: 540 },
			irgun: false,
			color: 'bordo',
		
			name: 'כח לקהילה',
			desc: ['התארגנות אזרחית שהקימו תושבות/י דרום תל אביב, ישראליות/ים ופליטות/ים, במטרה להאבק יחד באפליה הממוסדת נגד השכונות וכל תושביהן.'],
			link: '/groups/54825c49abb7e0355f8ab8e9'
		},{
			region: { x: 68, y: 531 },
			irgun: true,
			color: 'bordo',
		
			name: 'התנועה לעתיד הנגב המערבי',
			desc: ['תנועה הפועלת לקידום לאלתר של פיתרון קבע בעזה שיביא ביטחון ושגשוג לנגב ולישראל כולה.'],
			link: '/groups/54825c4aabb7e0355f8ab8ea'
		},{
			region: { x: 204, y: 570 },
			irgun: true,
			color: 'bordo',
		
			name: 'תור המדבר מיסודה של קהילת קמה',
			desc: ['עמותה המהווה פלטפורמה למימוש החזון המשותף לשינוי חברתי של חברי קהילת קמה ושותפיה לדרך.','העמותה פועלת למען צמצום הפערים החברתיים והכלכליים, ולקידום הסולידריות החברתית בנגב, בפריפריה ובארץ. זאת בהתבסס על תפיסת עולם סוציאל- דמוקרטית, וערכים של שוויון, צדק, שותפות וקיימות.'],
			link: '/groups/54825c4babb7e0355f8ab8eb'
		},{
			region: { x: 59, y: 341 },
			irgun: false,
			color: 'bordo',
		
			name: 'תנועת אשדודים',
			desc: ['תנועה חברתית- פוליטית שהוקמה על ידי פעילים חברתיים מרכזיים באשדוד שפעלו בשנים האחרונות בהתנדבות בארגונים שונים למען תושבי העיר.'],
			link: '/groups/54825c4dabb7e0355f8ab8ec'
		},{
			region: { x: 368, y: 629 },
			irgun: false,
			color: 'bordo',
		
			name: 'פרלמנט צעירי הנגב',
			desc: ['פרלמנט אזורי שהוא המשך תהליך שהתחיל ברמה המקומית בנגב. חברים בו כ- 22 פעילים מפרלמנטים שונים בנגב: שדרות, נתיבות, אופקים, ב"ש, עומר, רמת נגב, לאקייה, ערד, דימונה, ירוחם וביר אל-משאש. קיימים כשנה.','בפרלמנט כמה ועדות העובדות מול הרשויות ומקבלי ההחלטות בנושאי: תעסוקה, דו-קיום (בדואים-יהודים), צדק חלוקתי ותחבורה ציבורית.','נושא אחרון בו מתעסקים הוא הקמת 10 הישובים החדשים במבואות ערד - כרגע המצב הוא שהעניין אושר לכתיבת תוכנית מתאר - כל זה נעשה מתחת לרדאר שלהם.'],
			link: '/groups/54825c4eabb7e0355f8ab8ed'
		},{
			region: { x: 115, y: 270 },
			irgun: false,
			color: 'bordo',
		
			name: 'פורום תושבי ירוחם לצדק חלוקתי ותכנון אזורי',
			desc: ['פורום שהוקם לפני כשנתיים וכולל עשרות מתושבי ירוחם שרואים בצדק חלוקתי ותכנון אזורי מרכיבים אסטרטגיים לקיימות היישוב.','ירוחם היא קהילה צומחת שלוקחת את גורלה בידיה. את המאבק לצדק החלוקתי אנו מובילים מתוך ראייה אסטרטגית ארוכת טווח, אחריות לעתידנו ועתיד ילדינו, גאווה ואהבה למקום בו אנו חיים.','המאבק מתבצע מתוך דרישת זכויות, ערכי שוויון, ראייה מפוכחת של המציאות, ותפיסה ברורה של הצורך בתיקונה. הפורום ביצע מהלכי למידה, חשיבה ודיאלוג מקיפים בנושא.'],
			link: '/groups/54825c4fabb7e0355f8ab8ee'
		},{
			region: { x: 307, y: 266 },
			irgun: false,
			color: 'bordo',
		
			name: 'המטה לעתיד חריש והאזור',
			desc: ['מטה משותף של חריש, קיבוצים וכפרים ערביים באיזור.','המטה קם לפני 3 שנים בעקבות היוזמה של משרד השיכון להפוך אותה לעיר לחרדים בלבד. כבר כ 15 שנה ישנן תשתיות להקמת עיר אך לא מאפשרים לעיר להתפתח בשביל לייעד אותה לחרדים בלבד. בחריש כ 1300 תושבים (רובם חילונים). הכיוון של השר אטיאס הוא שהעיר תהיה החמישית בגודלה בישראל.','המטה עובד ב 3 מישורים עיקריים:','1. העיר שתוקם תהיה פתוחה לכולם - חרדים, חילונים, ערבים וכיוב\'.','2. העיר תהיה קטנה - בתחום התכנון המקורי של חריש.','3. ערכי השמירה על הסביבה ישמרו.','הגישו עתירה בנושא. הנושא קיבל רוח גבית עם פרוץ המחאה.','המטה שותף ומרושת באיזור: פרדס חנה, חדרה, אור עקיבא וכו\'.'],
			link: '/groups/54825c50abb7e0355f8ab8ef'
		},{
			region: { x: 291, y: 550 },
			irgun: false,
			color: 'bordo',
		
			name: 'פורום דו קיום בנגב',
			desc: ['פורום המקיים מפגשים בין קהילתיים, ואירועים חברתיים, ובהם פעילויות הסברה ופעילויות של מאבק באפליה בתעסוקה ובשירותים, מאבק לצדק חלוקתי ותביעה למציאת פתרונות הולמים לתושבי הכפרים הבלתי מוכרים.'],
			link: '/groups/54825c51abb7e0355f8ab8f0'
		},{
			region: { x: 209, y: 237 },
			irgun: false,
			color: 'bordo',
		
			name: 'קהילת הצדק החברתי ברחובות',
			desc: ['קבוצה שממשיכה להיפגש מאז 2011, פועלת בעיקר בעיר רחובות בשיתוף פעולה עם הערים השכנות.'],
			link: '/groups/54825c52abb7e0355f8ab8f1'
		},{
			region: { x: 479, y: 337 },
			irgun: false,
			color: 'bordo',
		
			name: 'קהילת נהריה והגליל המערבי',
			desc: ['מאהל מחאה נהרייה והגליל המערבי.','מתמקד באסיפת עם שכונתית נודדת. יצירת קשר עם תושבי השכונה ואוזן קשבת לבעיותיהם הספציפיות.'],
			link: '/groups/54825c53abb7e0355f8ab8f2'
		},{
			region: { x: 371, y: 328 },
			irgun: false,
			color: 'bordo',
		
			name: 'קהילת המחאה נורדאו',
			desc: ['קהילת אשר קמה כהמשך למאהל המחאה שהוקם בשדרה בקיץ האחרון (שהיה השני בגודלו בארץ) היא קמה מתוך הצורך, והשמחה, שגילינו באפשרות לקשר אמיתי עם אנשים מסביבנו, וכדרך להשפיע יחד על מציאות החיים של כולנו.','אנחנו פועלים, דרך חינוך ומעורבות בקהילה, לשינוי התודעה החברתית והאזרחית במטרה להניע יותר אנשים להיות מעורבים ולהשפיע על השלטון המקומי והארצי. הקהילה מקיימת הרצאות באמצע השבוע וקבלות שבת ביום שישי פעם בשבועיים.','אחת היוזמות שיצאו מפעילים במאהל היא הקמת קואופרטיב "שלנו".'],
			link: '/groups/54825c54abb7e0355f8ab8f3'
		},{
			region: { x: 427, y: 250 },
			irgun: false,
			color: 'bordo',
		
			name: 'מאהל ארלוזורוב',
			desc: ['מאהל מחוסרי הדיור גן וולובסקי תל אביב.'],
			link: '/groups/54825c55abb7e0355f8ab8f4'
		},{
			region: { x: 565, y: 379 },
			irgun: false,
			color: 'bordo',
		
			name: 'קהילת המחאה קריית שמונה',
			desc: ['תנועת המחאה בקריית שמונה. בסיס הפעולה בקפה "חברותא".'],
			link: '/groups/54825c56abb7e0355f8ab8f5'
		},{
			region: { x: 81, y: 432 },
			irgun: false,
			color: 'bordo',
		
			name: 'הנגב מתעורר ודורש צדק חברתי',
			desc: ['העמוד הרשמי של המחאה בנגב ומאהל המחאה בבאר שבע! כולם מצטרפים ונאבקים למען צדק חברתי, בפרט בנגב!'],
			link: '/groups/54825c58abb7e0355f8ab8f6'
		},{
			region: { x: 234, y: 326 },
			irgun: false,
			color: 'bordo',
		
			name: 'תא מס\' 1',
			desc: ['תא ראשון מתנועה אזרחית - עממית - פוליטית (לא מפלגתית).','ארגון דמוקרטי החורט על דגלו שוויון לכולם, חירות, הדדיות, חיי קיימות וקהילתיות; למען כינון חברה צודקת, מגוונת ומשגשגת.','חברי התא מאמינות/ים כי הדרך למימוש שאיפותינו מתחילה בהקמת רשת תאים קהילתיים, שיפעלו אזורית או נושאית לפי בחירתם. זאת במקביל לחבירה ושיתוף פעולה עם פעילים/ות, קבוצות וארגונים קיימים מכלל הקהילה האקטיביסטית – כך נוכל לבנות את התנועה המהפכנית שתהיה לנו לבית פוליטי ולתקווה בת קיימא לשינוי.'],
			link: '/groups/54825c59abb7e0355f8ab8f7'
		},{
			region: { x: 153, y: 360 },
			irgun: false,
			color: 'bordo',
		
			name: 'קבוצת כלכלה וחברה שדרות',
			desc: ['תושבי שדרות מדברים, לומדים ופועלים למען כלכלה הוגנת.'],
			link: '/groups/54825c5aabb7e0355f8ab8f8'
		},{
			region: { x: 1289, y: 873 },
			irgun: true,
			color: 'sky',
		
			name: 'פרוייקט ונוס',
			desc: ['ארגון עולמי שמייצג מציאות עתידית אלטרנטיבית ותכנית פעולה פרקטית וברורה איך לשנות את השיטה הנוכחית.'],
			link: '/groups/54825c5babb7e0355f8ab8f9'
		},{
			region: { x: 1299, y: 963 },
			irgun: false,
			color: 'sky',
		
			name: 'מדברים קנאביס',
			desc: ['התארגנות אה-פוליטית של אזרחים הקוראים לרשויות המדינה להידברות חברתית-אחראית, על מכלול סוגיית הקנאביס.','"מגילת האמת על הקנאביס": דרישה להקמתה המידית של ועדת חקירה ממלכתית מס\'-19 / קנאביס והשלכותיו על החברה הישראלית- (עפ"י חוק ועדות חקירה 1968 ותיקון מס\'-5)','* ללא מסקנות הוועדה, אין שום הצדקה מוסרית להתעללות בעשרות אלפי חולים ורדיפתם של מאות אלפי אזרחים והעמתדם תחת איום מתמיד של האשמה הפללה.','הקבוצה תחת ע.ר אל"א- אזרחים לוקחים אחריות.'],
			link: '/groups/54825c5cabb7e0355f8ab8fa'
		},{
			region: { x: 1184, y: 840 },
			irgun: false,
			color: 'sky',
		
			name: 'פרוייקט אמת אחרת',
			desc: ['פרויקט המהווה חלק מרשת עולמית של אתרי מידע וחדשות אלטרנטיביים שמציגים לציבור מידע חשוב שאינו זוכה לחשיפה בתקשורת הממוסדת.'],
			link: '/groups/54825c5dabb7e0355f8ab8fb'
		},{
			region: { x: 1122, y: 1048 },
			irgun: false,
			color: 'sky',
		
			name: 'מפיצי אור בפייסבוק',
			desc: ['קבוצה המרכזת חדשות חיוביות, מצחיקות, מרגשות ומעוררות תקווה, וחדשות של חדשנות חברתית, במטרה לשנות את התודעה דרך השיתופים בפייסבוק.','לתודעה חיובית יותר.'],
			link: '/groups/54825c5eabb7e0355f8ab8fc'
		},{
			region: { x: 1209, y: 1012 },
			irgun: false,
			color: 'sky',
		
			name: 'לאהוב',
			desc: ['קבוצה שקמה במטרה לעורר את העם לעשייה, למודעות ומעורבות חברתית, כדי לייצר אחדות בין ימין ובין שמאל, חרדים וחילוניים, וכדי לבנות חברה ערכית מלוכדת וטובה יותר.'],
			link: '/groups/54825c5fabb7e0355f8ab8fd'
		},{
			region: { x: 1332, y: 1050 },
			irgun: false,
			color: 'sky',
		
			name: 'מ-ה-פ-כ-ה',
			desc: ['כל העדכונים על המחאה החברתית החשובה בתולדות ישראל!','אנו מקדמים ומפרסמים אירועים רבים של מגוון תנועות למען צדק חברתי, בתנאי שהמסרים של אותו אירוע מייצגים את הערכים החברתיים-כלכליים, שאנו מאמינים בהם.'],
			link: '/groups/54825c60abb7e0355f8ab8fe'
		},{
			region: { x: 1377, y: 910 },
			irgun: false,
			color: 'sky',
		
			name: 'גרילה תרבות',
			desc: ['גרילה תרבות היא קבוצה פתוחה של יוצרות ויוצרים שבאה לקדם מאבקים חברתיים ופוליטיים על ידי זעקת שירה, מוזיקה ויצירה.','הארגון מחבר בין משוררים לפעילות מחאה שונות. בזמן המחאה קיימו ערבי משוררים במאהלים שונים.'],
			link: '/groups/54825c62abb7e0355f8ab8ff'
		},{
			region: { x: 1089, y: 854 },
			irgun: false,
			color: 'sky',
		
			name: 'קהילת אמני אנ״ת (אומנות נותנת תרומה)',
			desc: ['קהילת אמני אנ״ת בוגרי שנת שירות בגרעין האומנויות של התנועה וביחד כבוגרים פועלים, כל אחד בתחומו, לשינוי או ראיה לתפיסה חברתית הדוגלת באומנות ככלי לביטוי והגשמה.','הפעילות על פי שיטה אשר הומצאה על ידי הקהילה- ״מדברים אומנות״ שמה. פועלים בצבא, במשרות חינוכיות וחברתיות ברחבי הארץ ובשנת השירות.'],
			link: '/groups/54825c63abb7e0355f8ab900'
		},{
			region: { x: 1243, y: 1100 },
			irgun: false,
			color: 'sky',
		
			name: 'פורום סוכני שינוי במרחב המקומי',
			desc: ['פורום אשר קם במטרה להוות פלטפורמה לפעילים חברתיים, נבחרי ציבור ועובדי רשויות מקומיות המעוניינים ביצירת שינוי חברתי.'],
			link: '/groups/54825c64abb7e0355f8ab901'
		},{
			region: { x: 1056, y: 971 },
			irgun: false,
			color: 'sky',
		
			name: 'מהפכה של אהבה',
			desc: ['התארגנות ללא מטרת רווח, רשת של אנשים פרטיים ששמנו לעצמנו למטרה ליצור אנושות שנהנית מאהבת חינם.'],
			link: '/groups/54825c65abb7e0355f8ab902'
		},{
			region: { x: 468, y: 160 },
			irgun: true,
			color: 'pink',

			name: 'שתיל',
			desc: ['מרכז המספק שירותי תמיכה וייעוץ לקידום שינוי חברתי בישראל.','שתיל פועל למען צדק חברתי וכלכלי, זכויות האדם והאזרח, פלורליזם דתי ותרבותי, עולי אתיופיה וחבר העמים לשעבר, מזרחים, קידום זכויות הפלסטינאים תושבי ישראל וקידום נושאי סביבה וקהילה.'],
			link: '/groups/54825c66abb7e0355f8ab903'
		},{
			region: { x: 504, y: 66 },
			irgun: true,
			color: 'pink',

			name: 'מכון "שחרית" לפוליטיקה חדשה',
			desc: ['מכון חשיבה ועשייה לפוליטיקה חדשה.','"שחרית" משלב בין חשיבה למעשה דרך קואליציה מגוונת של קהילות במדינת ישראל. מטרתנו לבנות מכנה משותף בין כלל הקבוצות בתרבות הישראלית ליצירת עתיד מקיים המאפשר שגשוג לכל.'],
			link: '/groups/54825c67abb7e0355f8ab904'
		},{
			region: { x: 599, y: 64 },
			irgun: true,
			color: 'pink',

			name: 'המרכז הישראלי להעצמת האזרח',
			desc: ['המרכז הפועל להגברת יחסי האמון שבין הציבור לבין המערכת הציבורית והפוליטית ומתמקד בטיוב עבודת הממשל כלפי האזרחים ובחיזוק המסוגלות האזרחית.','כיום פועל המרכז לחיזוק האפקטיביות של המגזר הציבורי, תוך התמקדות בכשלי המערכת בתחום יישום המדיניות.','המרכז שם לו למטרה לעסוק בהיבטים שונים הנוגעים ליכולות המימוש והביצוע של הרשות המבצעת, למבנה ותמהיל החסמים המונעים מימוש מדיניות, ולחולשת "הצנרת" בתהליכי היישום הממשלתיים.'],
			link: '/groups/54825c68abb7e0355f8ab905'
		},{
			region: { x: 564, y: 145 },
			irgun: true,
			color: 'pink',

			name: 'מרכז אדוה',
			desc: ['מכון בלתי תלוי לחקר החברה הישראלית ולקידום רעיון השוויון והצדק החברתי.','מתמקד בחקר במדיניות החברתית בישראל וניתוחה, ובוחן באופן ביקורתי את הצעדים הננקטים בתחומי התקציב, המיסוי והשירותים החברתיים - חינוך, בריאות, שיכון, רווחה, תחבורה וסביבה, וכן את השלכותיהם של צעדים אלה על החברה הישראלית כולה ועל כל אחת מהקבוצות המרכיבות אותה.'],
			link: '/groups/54825c69abb7e0355f8ab906'
		},{
			region: { x: 691, y: 97 },
			irgun: true,
			color: 'pink',

			name: 'מכון טאוב',
			desc: ['מרכז לחקר המדיניות החברתית בישראל הוא מוסד עצמאי ולא מפלגתי למחקר חברתי-כלכלי, היושב בירושלים.','המרכז עוסק במחקר בלתי תלוי של המצב החברתי-כלכלי בישראל ומעלה חלופות חדשניות וישימות למדיניות ציבורית, החותרת לצמצום אי-השוויון ומקדמת את רווחתם של תושבי ישראל.','המרכז שואף להשפיע על עיצוב המדיניות על-ידי קיום קשר ישיר עם מעצבי המדיניות והעשרת הדיון הציבורי המתלווה לתהליך קבלת ההחלטות במדינה.'],
			link: '/groups/54825c6aabb7e0355f8ab907'
		},{
			region: { x: 401, y: 101 },
			irgun: true,
			color: 'pink',

			name: 'המכללה הכלכלית חברתית',
			desc: ['מוסד לימודי ללא כוונת רווח, שמטרתו קידום סדר כלכלי וחברתי חדש בנוף הישראלי.','זאת באמצעות הרצאות וקורסים להעשרה בנושאים חברתיים-כלכליים, המועברים בהתנדבות מלאה על ידי מאות מרצים.'],
			link: '/groups/54825c6cabb7e0355f8ab908'
		},{
			region: { x: 945, y: 10 },
			irgun: false,
			color: 'orange',
		
			name: 'זו לו טעות זו מדיניות',
			desc: ['אתר שהוקם על מנת לחשוף את מה שמסתירים מאיתנו. את השיטה מאחורי המציאות הכלכלית והפוליטית המורכבת שאנו שבויים בתוכה.','להעלות את הנתונים, לחבר את הנקודות, ולגלות את הסיפור האמיתי. זו לא טעות. זו מדיניות.','בעזרת תחקירים ואינפוגרפיקות האתר שופך אור על האפלה בה מתנהלים התהליכים שמנהלים את חיינו, ומנגיש את המידע לציבור.'],
			link: '/groups/54825c6dabb7e0355f8ab909'
		},{
			region: { x: 1329, y: 191 },
			irgun: false,
			color: 'orange',

			name: 'המשרד לתקשורת חברתית',
			desc: ['משרד הפרסום החברתי הראשון בישראל. חבריו היו מהגרעין היוזם של המחאה ופעלו לאורך אותו הקיץ על כל ההיבטים המקצועיים של המחאה – קריאייטיב, ניו מדיה, יח"צ ודוברות, הפקת עצרות, גיוס אמנים, בניית אסטרטגיה, כתיבת נאומים ועוד.','בשלוש השנים האחרונות הפך המשרד לתקשורת חברתית למשרד פרסום חברתי המורכב מאנשי מקצוע מובילים וערכיים המובילים יחד מאבקים ומספקים כלים מקצועיים לארגונים חברתיים ולקמפיינים ציבוריים שונים.']
		},{
			region: { x: 24, y: 1300 },
			directLink: 'http://www.anu.org.il/'
		},{
			region: { x: 48, y: 1402 },
			directLink: 'http://www.mican.co.il/'
		}
	];

	var zoom = 0.1;
	var zoomingDevice = false;
	var offset_y = 0;
	var offset_x = 0;
	var mouse_x = 0;
	var mouse_y = 0;
	var is_dragging = false;
	var mouse_down = false;
	var over_link = false;

	function setContentEvents(toggle){

		if (toggle){

			interactElem = $(document);

			interactElem.on('mousewheel', function(event, delta){

				zoomingDevice = true;

				// Set the zoom factor
				var zoom_factor = 1.09;
				if (delta < 0) zoom_factor = 1 / zoom_factor;

				if (zoom * zoom_factor > 1.5 ||
				    zoom * zoom_factor < 0.1)
					return;

				// Calculate new view paramters
				offset_x = mouse_x * (1 - zoom_factor) + zoom_factor * offset_x;
				offset_y = mouse_y * (1 - zoom_factor) + zoom_factor * offset_y;
				zoom *= zoom_factor;

				// Redraw
				zoom_images();
				event.preventDefault();
			});
			interactElem.on('mousemove', function(e){
				if (mouse_down)
				{
					is_dragging = true;
					offset_x += e.pageX - mouse_x;
					offset_y += e.pageY - mouse_y;
					move_images();
				}
				mouse_x = e.pageX;
				mouse_y = e.pageY;

				var link = get_link();
				if ((link == null || link == "") && (over_link))
				{
					over_link = false;
					$("body").css("cursor", "default");
				}
				else if (link != null && link != "" && !over_link)
				{
					over_link = true;
					$("body").css("cursor", "pointer");
				}
			});
			interactElem.on('mousedown', function(e){
				mouse_down = true;
				$(document).css("cursor", "url('images/grab.cur'),move");

				e.preventDefault();
			});
			interactElem.on('mouseup', function(e){
				
				mouse_down = false;
				if (is_dragging){ is_dragging = false } else {

					if ($(e.toElement).is('img#map')){
						var eRegion = {};

						if (!zoomingDevice){
							var offset = $('img#map').offset();
							var x = e.clientX - offset.left;
							var y = e.clientY - offset.top;

							eRegion = get_hovered_region(x,y)
						} else {
							eRegion = get_hovered_region();
						}

						if (eRegion && eRegion.link){
							window.open(eRegion.link, '_top');
						}
					}
				}

			});
		} else {
			interactElem.off('mousewheel');
			interactElem.off('mousemove');
			interactElem.off('mousedown');
			interactElem.off('mouseup');
		}
	}

	function init()
	{
		// First - hide the content and move the "loading" tag to the center
		$("#content").css("visibility", "hidden");
		center_loading_tag();

		// Hide the scroll bars
		$("body").css("overflow", "hidden");

		// Set the cursor to be regular (IE again... arggggg...)
		$(document).css("cursor", "url('images/cursor/cursor.ico'),auto");

		setContentEvents(true);

		var img = $('<img />').attr({ 	'id': 'map',
			                            'src': 'images/map.jpg',
																	'usemap': '#a',
			                            'data-x': 0,
			                            'data-y': 0
		                            }).appendTo($('#content'));
		$("#map").css("position", "absolute");

		$("#map").on("load", function()
		{
			$(this).attr({ 'data-original-width':  $(this).width(),
				             'data-original-height': $(this).height() });
			complete_init();
		});
	}

	function get_hovered_region(x, y){
		var regionDefaults = { w: 70, h: 70 };

		if (x && y){

			var imgMap = $('img#map');
			var ratio = imgMap.data('original-width') / imgMap.width();

			var rationedX = x * ratio;
			var rationedY = y * ratio;

			var corespondingRegion = undefined;

			$.each(regions, function(){
				var sizedRegionX, sizedRegionY;

				if (!this.directLink){
					sizedRegionX = this.region.x + 70;
					sizedRegionY = this.region.y + 70
				} else {
					sizedRegionX = this.region.x + 165;
					sizedRegionY = this.region.y + 100
				}

				if (this.region.x < rationedX && rationedX < sizedRegionX){
					if (this.region.y < rationedY && rationedY < sizedRegionY){
						corespondingRegion = this;
						return false
					}
				}
			});

			if (corespondingRegion){

				if (corespondingRegion.directLink){
					window.location.href = corespondingRegion.directLink

				} else {
					return corespondingRegion
				}

			} else {
				return null
			}

		} else {
			var relative_x = (mouse_x - offset_x
				                 )/zoom;
			var relative_y = (mouse_y - offset_y
				                 )/zoom;

			var factor = 1;

			for (var i = 0; i < regions.length; i++){
				var currentRegion = $.extend({}, regionDefaults, regions[i].region);

				if (relative_x > currentRegion.x*factor && relative_x < (currentRegion.x + currentRegion.w
					                                                        )*factor && relative_y > currentRegion.y*factor &&
				    relative_y < (currentRegion.y + currentRegion.h
					                 )*factor){
					return regions[i]
				}
			}
		}
	}

	function get_link(){
		var hovered = get_hovered_region();

		// $("#debug").html(relative_x + ", " + relative_y + "<br>" + ((hovered_region == null) ? "&lt;none&gt" : hovered_region.orgname));

		return (hovered == null) ? null : hovered.link || "no-external";
	}

	function complete_init()
	{
		var viewport_width = $("#map").data("original-width");
		var viewport_height = $("#map").data("original-height");

		// Set parameters to center the viewport
		zoom = Math.min($(window).width() / viewport_width,
		                $(window).height() / viewport_height);

		offset_x = ($(window).width() - (viewport_width * zoom)) / 2;
		offset_y = ($(window).height() - (viewport_height * zoom)) / 2;

		// We're done initializing - prepare display
		relocate_images();

		// Now - we are only left to remove the "loading" and show our content!
		$("#loading").remove();
	}

	function zoom_images()
	{
		var image_object = $("#map");
		image_object.stop();
		image_object.animate( {	left: image_object.data("x") * zoom + offset_x,
			                      top:  image_object.data("y") * zoom + offset_y,
			                      width: zoom * image_object.data("original-width"),
			                      height: zoom * image_object.data("original-height") } );
	}

	function move_images()
	{
		var image_object = $("#map");
		image_object.offset({left: image_object.data("x") * zoom + offset_x,
			                    top:  image_object.data("y") * zoom + offset_y});
	}

	function relocate_images()
	{
		var image_object = $("#map");

		image_object.offset({left: image_object.data("x") * zoom + offset_x,
			                    top:  image_object.data("y") * zoom + offset_y});
		image_object.width(zoom * image_object.data("original-width"));
		image_object.height(zoom * image_object.data("original-height"));

		$("#content").css("visibility", "visible");

	}

	function center_loading_tag()
	{
		$("#loading").offset({ top:  ($(document).height() - $("#loading").height()) / 2,
			                     left: ($(document).width() - $("#loading").width()) / 2 });
	}

	$(document).ready(init);

})(jQuery);